tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
brew "curl"
brew "git"
brew "tree"
brew "pass"
# brew "postgresql", restart_service: true
# brew "rbenv"
# brew "nodenv"
# brew "pyenv"
# brew "tfenv"
brew "rename"
brew "wget"
cask "qlmarkdown"
brew "gnupg"
brew "yubikey-personalization"
brew "hopenpgp-tools"
brew "ykman"
brew "pinentry-mac"


tap "1password/tap"
tap "alphagov/gds"
tap "cloudfoundry/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "jsontypedef/jsontypedef"
brew "zstd"
brew "libtiff"
brew "git"
brew "asdf"
brew "aws-vault"
brew "awscli"
brew "glib"
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "curl"
brew "dive"
# brew "docutils"
brew "folly"
brew "fizz"
brew "wangle"
# brew "fbthrift"
# brew "fb303"
# brew "edencommon"
brew "gh"
brew "unbound"
brew "gnutls"
# brew "gnupg"
# brew "gobject-introspection"
# brew "gopass"
# brew "gpgme"
# brew "guile"
# brew "handbrake"
# brew "harfbuzz"
# brew "hopenpgp-tools"
brew "htop"
# brew "hub"
# brew "openjpeg"
# brew "imagemagick"
# brew "jira-cli"
brew "jq"
brew "pandoc"
# brew "jupyterlab"
brew "libgit2"
brew "libpq"
# brew "llvm"
brew "maven"
brew "mvfst"
# brew "nginx"
brew "node-build"
brew "openapi-generator"
brew "tree"
brew "pass"
brew "pdftohtml", link: false
# brew "poppler"
brew "pdftoipe"
brew "pinentry-mac"
brew "poetry"
brew "postgresql@14"
brew "pre-commit"
brew "python-matplotlib"
brew "python@3.10"
brew "python@3.11"
brew "rename"
brew "ruby-build"
brew "rust"
brew "shellcheck"
brew "tflint"
brew "tfsec"
brew "twty"
brew "watch"
brew "watchman"
brew "wget"
brew "yamllint"
brew "yarn"
brew "ykman"
brew "ykpers"
brew "alphagov/gds/gds-cli"
brew "cloudfoundry/tap/cf-cli@8"
brew "heroku/brew/heroku"
brew "jsontypedef/jsontypedef/jtd-codegen"
cask "1password-cli"
cask "basictex"
# cask "chromedriver"
cask "freeplane"
# cask "gcloud-cli"
# cask "inkscape"
cask "insomnia"
cask "maccy"
cask "notunes"
cask "obsidian"
cask "qlmarkdown"
cask "signal"
cask "sqlitestudio"
cask "sublime-text"
cask "temurin"
cask "tigervnc"
cask "vscodium"
cask "yed"
# vscode "4ops.terraform"
# vscode "alefragnani.project-manager"
# vscode "bung87.rails"
# vscode "bung87.vscode-gemfile"
# vscode "codezombiech.gitignore"
# vscode "connorshea.vscode-ruby-test-adapter"
# vscode "damonsk.vscode-wardley-maps"
# vscode "donjayamanne.git-extension-pack"
# vscode "donjayamanne.githistory"
# vscode "dotjoshjohnson.xml"
# vscode "eamodio.gitlens"
# vscode "github.vscode-github-actions"
# vscode "golang.go"
# vscode "hbenl.vscode-test-explorer"
# vscode "koichisasada.vscode-rdbg"
# vscode "littlefoxteam.vscode-python-test-adapter"
# vscode "mechatroner.rainbow-csv"
# vscode "ms-azuretools.vscode-containers"
# vscode "ms-azuretools.vscode-docker"
# vscode "ms-python.debugpy"
# vscode "ms-python.python"
# vscode "ms-python.vscode-pylance"
# vscode "ms-python.vscode-python-envs"
# vscode "ms-vscode.test-adapter-converter"
# vscode "ms-vsliveshare.vsliveshare"
# vscode "redhat.vscode-yaml"
# vscode "shopify.ruby-extensions-pack"
# vscode "shopify.ruby-lsp"
# vscode "sianglim.slim"
# vscode "sorbet.sorbet-vscode-extension"
# vscode "takumii.markdowntable"
# vscode "ziyasal.vscode-open-in-github"
