tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
brew "curl"
brew "git"
brew "tree"
brew "pass"
brew "postgresql", restart_service: true
brew "rbenv"
brew "nodenv"
brew "pyenv"
brew "tfenv"
brew "rename"
brew "wget"
cask "qlmarkdown"
brew "gnupg"
brew "yubikey-personalization"
brew "hopenpgp-tools"
brew "ykman"
brew "pinentry-mac"
